// Напишите программу, которая на вход принимает число (N) и выдает таблицу кубов чисел от 1 до N.

Console.Write("Введите целое число N ");

